[
    {
      "ProjectName": "Mercado",
      "TeamName": "CodeWalkers",
      "GithubLink": "https://github.com/armaanansari121/Mercado",
      "DeployedLink": "https://mercado-ruby.vercel.app/",
      "YoutubeLink": "https://www.youtube.com/watch?v=DdEU7GmYyWQ",
      "MemberOne": " Mohammed Armaan Ansari",
      "MemberTwo": "Harsh Kasana",
      "MemberThree": " Prakhar Srivastava",
      "ProblemSolve": "Addressing Market Imperatives (Problems Addressed)\nGlobal Creative Nexus: Eliminates geographical constraints, connecting diverse artists with a worldwide audience.\n\nEquitable Asset Valuation: Deploys cutting-edge algorithms to ensure digital assets are priced according to real-time market forces.\n\nMeritocratic Exposure: Levels the playing field, allowing emerging artists to gain recognition based on talent rather than pre-existing fame.\n\nUnprecedented Customization: Grants creators unparalleled control over their digital presence and brand representation.\n\nStreamlined Commissioning: Revolutionizes the custom art market by providing a secure, efficient platform for bespoke digital creations.\n\nTrust-Centric Ecosystem: Establishes a robust reputation system, fostering a high-integrity environment for all participants.\n\nSeamless Onboarding: Simplifies entry for newcomers through intuitive ETH-to-MERCAT conversion processes.\n\nCommunity-Driven Growth: Fosters a dynamic, interactive community that drives long-term platform engagement and value creation.\n\nPortfolio Diversification: Offers collectors unprecedented access to a wide array of digital assets, enabling strategic portfolio construction.\n\nEconomic Paradigm Shift: Creates novel revenue streams for digital creators, catalyzing a new era of creative economics.",
      "Challenges": "Creating a Very Complex 3-Tiered Smart Contract\nThis involves managing multiple layers of access and functionality within the contract, ensuring secure interactions between tiers, and implementing robust access control, error handling, and security measures to manage the contract's complexity.\nUsing IPFS to Manage Data\nUtilizing IPFS requires handling decentralized storage, managing data integrity through secure linking with the smart contract, addressing potential delays in data retrieval, and ensuring privacy by possibly encrypting data before uploading.\nIntegrating Chart.js\nChallenges include efficiently fetching and formatting blockchain data for visualization, ensuring smooth interactivity and real-time updates in charts, and managing performance issues when dealing with complex or large datasets.\nDecentralized Finance (DeFi)\nDeFi involves implementing secure financial logic in smart contracts, managing liquidity risks, and ensuring interoperability with other protocols, all while maintaining robust security to prevent vulnerabilities.\n"
    },
    {
      "ProjectName": "Artify - Decentralized Art Marketplace",
      "TeamName": "Builders",
      "GithubLink": "https://github.com/Irisisme2/Artify",
      "DeployedLink": "",
      "YoutubeLink": "",
      "MemberOne": "Wiktoria Jarema",
      "MemberTwo": "",
      "MemberThree": "",
      "ProblemSolve": "The Problem Artify Solves\nIn the digital art world, artists face challenges like:\n\nCentralized Control: 🏛️ Platforms and galleries often control how artists distribute and monetize their work, leading to high fees and limited creative freedom. 🎨\n\nSecurity and Ownership: 🔒 Digital artists struggle to protect their work from unauthorized use, piracy, and copying, making it hard to maintain ownership and prove authenticity. 🖼️\n\nHigh Transaction Costs: 💸 Existing platforms involve high transaction fees, making it less profitable for artists, especially those with lower-priced pieces. 🎟️\n\nLack of Global Access: 🌍 Geographical and financial barriers limit access to global art markets, making it difficult for artists to reach a worldwide audience. ✈️\n\nHow Artify Solves These Problems\nDecentralized Control: 🛠️ Artify empowers artists to maintain full control over their work. Using blockchain technology, they can sell their creations as NFTs without intermediaries, ensuring they retain most of their earnings. 💰\n\nSecure Ownership and Provenance: 📜 Artify mints each artwork as an NFT, a unique digital asset proving ownership and authenticity. These NFTs are stored on the Ethereum blockchain, providing a secure, immutable record of provenance. 🛡️\n\nLower Transaction Costs: 🪙 By using the Polygon network, Artify reduces transaction fees, making it cost-effective for artists and buyers, especially for smaller transactions. 🤑\n\nGlobal Reach: 🌐 Artify is accessible to anyone with an internet connection, allowing artists to reach a global audience without traditional gallery limitations. 🌏",
      "Challenges": "1. Integrating Multiple Blockchains: 🛠️ Integrating Ethereum, Polygon, and Filecoin into a single platform was complex due to each blockchain’s unique architecture. Ensuring smooth interoperability required extensive testing and debugging with Hardhat to resolve compatibility issues early on. 🔗\n\n2. High Gas Fees on Ethereum: 💸 Ethereum’s high gas fees made deploying and testing smart contracts expensive. We addressed this by using the Polygon network for most transactions and testing, which significantly reduced costs. Additionally, we optimized our Solidity code to make the contracts more gas-efficient. 🪙\n\n3. Decentralized Storage Integration: 📦 Storing large digital art files on the blockchain was impractical, so we integrated IPFS and Filecoin. Ensuring reliable and efficient file storage and retrieval without compromising performance was a challenge. We implemented a hybrid solution where metadata is stored on-chain while the content is stored on IPFS/Filecoin, ensuring that links between the blockchain and storage remained intact. 🔗\n\n4. Ensuring Security and Ownership: 🛡️ Protecting artists’ ownership rights and securing NFTs against tampering was crucial. Implementing access controls and securing smart contracts was challenging. We used OpenZeppelin’s audited libraries and conducted multiple testing rounds to identify and fix security gaps. 🔍\n\n5. User Experience and Onboarding: 🖥️ Simplifying the user experience, especially for Web3 newcomers, was essential. The complexities of setting up wallets and interacting with decentralized apps can be overwhelming. We focused on intuitive UI/UX design, integrated Web3.js for seamless interactions, and provided clear instructions and tutorials to guide users. 🎨\n\n"
    },
    {
      "ProjectName": "CrediFlow",
      "TeamName": "Builders",
      "GithubLink": "https://github.com/Aswinr24/CrediFlow",
      "DeployedLink": "https://web3ssh.vercel.app/",
      "YoutubeLink": "https://www.youtube.com/watch?v=uZ2vJaX2lIU",
      "MemberOne": " R ASWIN",
      "MemberTwo": "",
      "MemberThree": "",
      "ProblemSolve": "Traditional supply chain finance processes are riddled with inefficiencies, limited transparency, and high costs, fraud and security risks, primarily due to manual, paper-based operations, effective communication between buyers, suppliers, and other stakeholders is challenging, and the involvement of multiple intermediaries. These issues lead to slow processing times, increased error rates, and elevated financing costs. Additionally, the lack of a unified, real-time view of the supply chain and a secure platform for transaction verification fosters a trust deficit among suppliers, buyers, and financial institutions. This mistrust, coupled with frequent payment delays, adversely impacts suppliers' cash flow and financial stability. Ineffective risk management further exacerbates operational disruptions and financial losses.\n\nOur Project CrediFlow aims to solve these problems by leveraging blockchain technology to create a transparent, efficient, and secure supply chain finance ecosystem, improving cash flow, reducing financing costs, and enhancing trust among all participants.\n\nKey Features:\n\nDirect Buyer-Supplier Interaction: Eliminate intermediaries by creating a direct link between buyers and suppliers, streamlining the process and reducing reliance on third parties.\n\nComprehensive Features: Facilitate different use cases like purchase ordering, dynamic discounting, cross-border trading, and supplier risk assessment to optimize supply chain operations and financial management.\n\nSecuring Digital Payments: Implement an escrow system specifically for digital payments (cryptocurrencies), ensuring commitment and mitigating fraud risk.\n\nFacilitating Digital Payments: Enable fast, cost-effective transactions using digital tokens or cryptocurrencies.\n\nDecentralized Storage: Utilize IPFS (InterPlanetary File System) service- lighthouse.storage for securely storing and sharing documents and details, ensuring data integrity and availability.",
      "Challenges": "Time Constraints: With only 48 hours or so to develop a fully functional application, managing time effectively was crucial. Since I had multiple smart contracts to write, test and deploy it did consume a lot of time. Prioritizing tasks and making quick decisions on technology choices and implementation strategies added pressure.\n\nIntegrating wagmi Hooks: Integrating wagmi hooks to interact with the Ethereum smart contracts posed challenges. Ensuring smooth communication between the frontend and the blockchain required careful configuration and debugging.\n\nComplexity in Design: Balancing a robust design with the need to implement features quickly was challenging, particularly when dealing with complex flows like escrow management and purchase order processing.\n\nResource-Intensive Application: CrediFlow is proportionally a large application with numerous components interacting with the blockchain, smart contracts, and decentralized storage solutions like Lighthouse. This made the application resource-intensive, requiring efficient handling of computational and network resources.\n\n"
    },
    {
      "ProjectName": "TeraChain",
      "TeamName": "Utsav",
      "GithubLink": "https://github.com/Utsav631/TeraChain",
      "DeployedLink": "",
      "YoutubeLink": "https://youtu.be/86VXyaftmTs",
      "MemberOne": "Utsav Saini",
      "MemberTwo": "",
      "MemberThree": "",
      "ProblemSolve": "Land registry systems face issues like fraud, inefficiency, and legal disputes due to inaccurate records. These problems impact property rights, market efficiency, and government management of land.",
      "Challenges": "Throughout the development of TeraChain, we encountered several challenges that required innovative solutions. Scalability was a major concern, as we needed to ensure the system could handle a large volume of transactions without compromising performance. Data migration posed another challenge; transferring existing land records to the blockchain required meticulous attention to data accuracy and integrity. Additionally, we faced hurdles in user adoption, as introducing a new system involved overcoming resistance and providing extensive training. Ensuring regulatory compliance was also crucial, as we needed to navigate complex legal frameworks to ensure the system met all local and international requirements. These challenges, though difficult, ultimately strengthened the project and led to a more robust and user-friendly solution."
    },
    {
      "ProjectName": "Xfile",
      "TeamName": "Jai",
      "GithubLink": "https://github.com/jaikumar9/Xfile_hack",
      "DeployedLink": "https://xfile-hack.vercel.app/",
      "YoutubeLink": "https://youtu.be/pFnnQhYoyfc",
      "MemberOne": "Jai Agdayemawer",
      "MemberTwo": "",
      "MemberThree": "Xfile project aimed at solving centralized storage issues using the Pinata SDK on the Polygon Amoy testnet. Throughout the process, I faced several challenges, including RPC errors, configuring the Web3 model, and writing the smart contract and Testing contracts. These experiences have strengthened my problem-solving skills and deepened my understanding of decentralized storage solutions. Here is Some Advice for Polygon Team Please Maintain the Nodes of Amoy Testnet, It always Throws RPC Errors.",
      "ProblemSolve": "Traditional file management systems are centralized, making them vulnerable to data breaches, unauthorized access, and single points of failure. Xfile addresses these issues by offering a decentralized solution that ensures enhanced security, data integrity, and user control.",
      "Challenges": "Xfile project aimed at solving centralized storage issues using the Pinata SDK on the Polygon Amoy testnet. Throughout the process, I faced several challenges, including RPC errors, configuring the Web3 model, and writing the smart contract and Testing contracts. These experiences have strengthened my problem-solving skills and deepened my understanding of decentralized storage solutions. Here is Some Advice for Polygon Team Please Maintain the Nodes of Amoy Testnet, It always Throws RPC Errors."
    },
    {
      "ProjectName": "Multi-Send Application",
      "TeamName": "Divyanshu",
      "GithubLink": "https://github.com/DivyanshuMajhi?tab=repositories",
      "DeployedLink": "",
      "YoutubeLink": "https://youtu.be/fJKawplKzEU",
      "MemberOne": "Divyanshu Majhi",
      "MemberTwo": "",
      "MemberThree": "",
      "ProblemSolve": "This application is useful for scenarios where multiple payments need to be processed simultaneously, saving time and reducing transaction fees.",
      "Challenges": "I could not do the transaction, as i did not have the extension required. Then I downloaded the particular extension required and the issue was solved."
    },
    {
      "ProjectName": "KNOW YOUR PATIENT [KYP]",
      "TeamName": "Kumar",
      "GithubLink": "https://github.com/DEVILKING10/KNOW-YOUR-PATIENTS",
      "DeployedLink": "",
      "YoutubeLink": "https://youtu.be/sXid5PsflCA",
      "MemberOne": "Kumar C",
      "MemberTwo": "",
      "MemberThree": "",
      "ProblemSolve": "The problem KNOW YOUR PATIENT [KYP] solves\napplying KYP principles within the Web 3.0 framework can significantly improve the management and security of patient data, enhance transparency, and empower patients in their healthcare journeys. By leveraging decentralized technologies, KYP can address many of the current challenges in health data management and patient care.",
      "Challenges": "Challenges I ran into\nlinking of ethereum database and metamask account , adding the details of doctor and patients details to the database"
    },
    {
      "ProjectName": "Grantitude",
      "TeamName": "Immutable",
      "GithubLink": "https://github.com/sinster2003/grantitude",
      "DeployedLink": "https://grantitude-github.vercel.app/",
      "YoutubeLink": "https://youtu.be/YN_j62jSnMY",
      "MemberOne": "Sindhur V Shabaraya",
      "MemberTwo": "Rakshita Patel",
      "MemberThree": "",
      "ProblemSolve": "The problem Grantitude solves\nProblem Faced\nIn the world of open-source development, maintaining a repository and attracting quality contributions can be challenging. Project maintainers often struggle to incentivize contributors, while contributors seek recognition and reward for their valuable work. Current systems for rewarding contributions are often manual, time-consuming, and lack transparency.\nGrantitude addresses these issues by providing a decentralized platform that streamlines the process of rewarding contributors for their efforts, ensuring fairness, transparency, and efficiency.\n\nHow Grantitude Makes It Easier\nSeamless Bounty Distribution: With just a few clicks, maintainers can reward contributors using smart contracts on the Ethereum blockchain, eliminating manual and error-prone processes.\nTransparency and Security: By leveraging blockchain technology, Grantitude ensures that all transactions are transparent and immutable. This fosters trust among contributors and maintainers, as every action is recorded on the blockchain.\nEnhanced Collaboration: By providing a clear incentive structure, Grantitude encourages more developers to contribute to open-source projects, driving innovation and collaboration across the community.\nSimplified Management: Grantitude provides a user-friendly dashboard for maintainers to award bounties and track contributions, making it easier to recognize and reward valuable work.\nSecure Wallet Integration: With MetaMask integration, maintainer can fund the contributor to his/her metamask address seamlessly via the address provided in their github bio.\nBy solving these challenges, Grantitude empowers open-source communities to thrive, making collaboration more rewarding and effective for all involved.",
      "Challenges": "Challenges we ran into\nDealing with GitHub APIs\nChallenge: Interacting with GitHub's APIs to fetch user and repository data presented challenges, particularly with rate limits and data consistency. Ensuring that our application correctly handled the API responses and managed errors effectively was crucial.\nSolution: Detailed documentation and GitHub API references were used to ensure proper implementation.\n\nEnsuring Security\nChallenge: Securing sensitive data, including users' Ethereum addresses and authentication tokens, was a major concern. We needed to protect against potential security vulnerabilities and data breaches.\nSolution: We followed best practices for security, such as:\nAll communications between our frontend and backend are encrypted using jwts via https.\nStoring Tokens Securely: We implemented secure storage solutions for authentication tokens and sensitive data.\nInput Validation: All user inputs are validated and sanitized to prevent injection attacks and other security issues.\nRegular Security Audits: We conducted regular security reviews and testing to identify and address potential vulnerabilities.\n\nGitHub OAuth to Manage Apps\nChallenge: Implementing GitHub OAuth for user authentication and app management required careful handling of access tokens and permissions. Ensuring that users could securely connect their GitHub accounts and manage their data involved navigating GitHub's OAuth flow and managing access scopes.\n\nSolution: We carefully followed GitHub's OAuth documentation to implement the authentication flow. We:\nConfigured OAuth Scopes: Limited the permissions requested to only what was necessary for our application.\nHandled Tokens Securely: Implemented secure methods for storing and using OAuth tokens to prevent unauthorized access."
    },
    {
      "ProjectName": "Happy Piggy Bank",
      "TeamName": "TERIDI",
      "GithubLink": "https://github.com/Akshitadimpu05/Web3Hackathon",
      "DeployedLink": "",
      "YoutubeLink": "",
      "MemberOne": "Rishitha Isbergaa",
      "MemberTwo": " Akshita Pagoti",
      "MemberThree": "TejaSri Pacharu",
      "ProblemSolve": "The conflict faced with general banks/saving accounts is that we have the need to pay high fees in order to deposit our money. This poses a problem when you're trying to find a safe space to store your wealth.\nWe've come up with a proposition where there can be a virtual piggy bank there which you can deposit your funds with very minimal additional charges and it comes with at most guarantee that your cash will be safe and encrypted.",
      "Challenges": "We found plenty of challenges and bugs in every step of the way, We took help from friends and watched tutorials to help us resolve our issues."
    },
    {
      "ProjectName": "Tokenize",
      "TeamName": "winter",
      "GithubLink": "https://github.com/jram17/tokenize",
      "DeployedLink": "https://tokenize-delta.vercel.app/",
      "YoutubeLink": "https://www.youtube.com/watch?v=thh9zAOpSNE",
      "MemberOne": " jayaram v",
      "MemberTwo": "",
      "MemberThree": "",
      "ProblemSolve": "In a usual decentralized exchange(DEX) , you would only be able to swap, already existing tokens. but in our platform you would be able to mint your own tokens and be able to swap them with already existing tokens .",
      "Challenges": "well since it was our first time with the tech stack, we did run into a few like deploying the contract and connecting it to the front-end of the website. However, we overcame them to deploy our project ."
    },
    {
      "ProjectName": "Carbon",
      "TeamName": "BYTEZ",
      "GithubLink": "https://github.com/4rjunc/carbon",
      "DeployedLink": "https://carbon-eight-zeta.vercel.app/",
      "YoutubeLink": "https://www.youtube.com/watch?v=92tCLbrMqUE",
      "MemberOne": "Arjun C",
      "MemberTwo": "Hari G",
      "MemberThree": " Anjana A",
      "ProblemSolve": "Carbon addresses significant challenges in the scientific research community by offering a decentralized marketplace for scientific data and research materials. It allows researchers to monetize their datasets, research papers, and notes, reaching a global audience and generating income from their work. For buyers, Carbon simplifies the acquisition of high-quality scientific resources, providing direct access to valuable data. The platform enhances security and integrity through decentralized storage with Filecoin, which protects data from tampering and loss. Smart contracts on the Polygon network ensure secure, transparent transactions and access control. With its user-friendly interface, Carbon makes buying and selling scientific products more efficient, driving innovation and collaboration in research.",
      "Challenges": "Integrating smart contracts posed a significant challenge during the development of Carbon. Debugging issues related to contract deployment, interaction, and transaction management was time-consuming. Developing a sustainable business model was also a complex task; to address this, we consulted with industry experts who provided valuable insights and guidance, helping us refine our approach and align our business model with both user needs and revenue objectives."
    },
    {
      "ProjectName": "Blockchain-based...",
      "TeamName": "DApp Developers",
      "GithubLink": "https://github.com/Mahesh-git888/DApp-developers",
      "DeployedLink": "",
      "YoutubeLink": "https://www.youtube.com/watch?v=683yW0HdGP8",
      "MemberOne": "mahesh_datta badvel",
      "MemberTwo": "CHALLA CHAKRADHARREDDY",
      "MemberThree": "Jaswanth Aditya",
      "ProblemSolve": "The Problem It Solves\n\nIn many developing countries, millions of people lack access to traditional banking and financial services. Existing microfinance institutions often charge high-interest rates, involve lengthy processes, and suffer from trust issues due to a lack of transparency and accountability.\n\nHow Our Platform Solves This:\n\nAccess to Financial Services:Provides a decentralized platform that enables underserved communities to access financial services without relying on traditional banks.\nLower Costs: By removing intermediaries, the platform reduces costs and interest rates, making loans more affordable for borrowers.\nTransparency and Trust: All transactions and agreements are recorded on the blockchain, ensuring transparency and building trust between borrowers and lenders.\nAutomation: Smart contracts automate the lending process, reducing delays and errors, and making the entire process more efficient and secure.\nPrivacy: Integrates Zero-Knowledge Proofs (ZKPs) to protect sensitive financial information while maintaining the integrity of transactions.",
      "Challenges": "Smart Contract Security:\n\nChallenge: Ensuring that the smart contracts were secure against vulnerabilities such as reentrancy attacks and overflow errors.\nSolution: We implemented thorough testing using Truffle and utilized established security practices like using the latest Solidity version with built-in security features and conducting code reviews.\nIntegrating Blockchain with Frontend:\n\nChallenge: Seamlessly connecting the React frontend with the Ethereum blockchain through Web3.js was initially complex, particularly handling asynchronous calls and managing the user's Ethereum wallet (e.g., MetaMask).\nSolution: We leveraged React hooks for state management and asynchronous operations, and thoroughly tested the integration to ensure smooth user interactions with the blockchain.\nDatabase Synchronization:\n\nChallenge: Ensuring that the off-chain data in our MySQL database remained synchronized with on-chain transactions, especially in scenarios with high concurrency.\nSolution: We implemented robust error handling and transaction management in our backend API, ensuring consistency between the blockchain and the database.\nZero-Knowledge Proof Integration:\n\nChallenge: Incorporating Zero-Knowledge Proofs (ZKPs) to ensure privacy while maintaining transaction integrity was technically challenging due to the complexity of ZKP algorithms.\nSolution: We studied and implemented Circom and SnarkJS for zk-SNARK proof generation, and conducted several rounds of optimization to make the ZKP process efficient and scalable.\nUser Experience on a Decentralized Platform:\n\nChallenge: Providing a smooth and intuitive user experience while dealing with the inherent complexity of blockchain technology was a key hurdle.\nSolution: We focused on simplifying the user interface and providing clear instructions and feedback at each step of the process, ensuring that users could interact with the platform without needing deep technical knowledge of blockchain."
    },
    {
      "ProjectName": "PharmZy",
      "TeamName": "Code Rushers",
      "GithubLink": "https://github.com/snehal261004/code-rushers",
      "DeployedLink": "",
      "YoutubeLink": "https://www.youtube.com/watch?v=AxobOLfCEdw",
      "MemberOne": " snehal vattikonda",
      "MemberTwo": "Znanasai Kolli",
      "MemberThree": "Harsha Vardhan",
      "ProblemSolve": "Problem: Counterfeit Pharmaceuticals in Supply Chains\n\nCounterfeit drugs are a pervasive and dangerous issue, affecting millions of people globally and causing significant health risks and economic losses. These fake medications often contain incorrect dosages, harmful ingredients, or no active ingredients at all, leading to ineffective or even harmful treatments. The problem is exacerbated by the complexity and lack of transparency in traditional pharmaceutical supply chains, where multiple intermediaries handle the products from production to distribution. This opacity makes it challenging to verify the authenticity and quality of drugs as they move through the supply chain. Consumers, pharmacies, and regulators face difficulties in distinguishing genuine products from counterfeits, leading to a loss of trust in the healthcare system. Additionally, counterfeit drugs can undermine pharmaceutical companies' reputations and result in substantial financial losses due to product recalls, legal actions, and decreased consumer confidence. The global nature of the pharmaceutical industry further complicates efforts to combat counterfeiting, as counterfeit drugs can easily cross borders and infiltrate legitimate supply chains. Traditional methods, such as paper-based tracking and certification, are often inadequate in providing the level of security and transparency needed to prevent counterfeiting. There is an urgent need for a solution that can effectively track and verify the authenticity of pharmaceuticals throughout the entire supply chain, from the manufacturer to the end consumer, to ensure patient safety and maintain the integrity of the pharmaceutical industry.",
      "Challenges": "Challenges We Encountered During Development\nDuring the development of our blockchain-based pharmaceutical supply chain solution, we encountered several technical and operational challenges, but one specific hurdle stood out: data synchronization across multiple stakeholders. Given the decentralized nature of blockchain, it was crucial that all participants in the supply chain—manufacturers, distributors, pharmacies, and regulators—had synchronized and consistent data. However, we ran into issues with latency and data inconsistency when participants used different systems and had varying levels of technological infrastructure.\n\nThis discrepancy led to delays in data updates, causing some stakeholders to access outdated information. For example, a manufacturer might update the status of a drug batch, but the change would not immediately reflect on the distributor's end due to network latency or synchronization issues. This not only threatened the integrity of the supply chain but also posed a risk to the real-time tracking and verification process, which is critical in preventing counterfeit drugs from entering the market.\n\nTo overcome this challenge, we implemented a two-pronged approach:\n\nOptimization of Consensus Mechanism: We re-evaluated our consensus algorithm and optimized it to reduce latency and improve data synchronization. By tweaking the parameters and using a more efficient consensus protocol, we were able to ensure that all nodes in the network could quickly and accurately verify transactions, leading to more consistent data across the blockchain.\n\nEnhanced Data Validation Protocols: We introduced additional validation checks at each stage of the supply chain. These checks ensured that data was not only synchronized but also accurate and consistent. If any discrepancies were detected, the system automatically flagged them for review, preventing inaccurate data from being propagated through the network."
    },
    {
      "ProjectName": "Decentralised Rare Disease Registry",
      "TeamName": "BlockBuster",
      "GithubLink": "https://github.com/Nooberd-Incompat/BlockBusters",
      "DeployedLink": "",
      "YoutubeLink": "https://www.youtube.com/watch?v=85at4Zd_KGs&t=2s&ab_channel=Pie",
      "MemberOne": "Piyush Singh ",
      "MemberTwo": "Sudip Halder",
      "MemberThree": "Yojith Kaustabh",
      "ProblemSolve": "Data Integrity and Trust\nProblem: Centralized systems risk tampering and data loss.\nSolution: Blockchain ensures immutable, tamper-proof records that build trust.\n\nCentralized Vulnerability\nProblem: Single points of failure compromise security.\nSolution: Decentralization enhances system resilience.\n\nPatient Privacy and Control\nProblem: Patients lack control over their data.\nSolution: Decentralized registries let patients manage data access, protecting privacy.\n\nGlobal Access and Collaboration\nProblem: Jurisdiction limits traditional registries.\nSolution: Decentralized systems enable global access and cooperation.\n\nTransparency in Data Sharing\nProblem: Opaque data sharing reduces trust.\nSolution: Smart contracts enable transparent, automated sharing.\n\nIncentivizing Participation\nProblem: Hard to motivate data contribution.\nSolution: Token economies reward patients and institutions for sharing data.\n\nInteroperability and Silos\nProblem: Data silos limit research.\nSolution: Blockchain promotes integration and a connected healthcare ecosystem.",
      "Challenges": "IPFS didn't accept large files. Also, for providing search by tags, it requires the CID hash of each registered disease. However, this clashes with the philosophy of privacy. Hence, we have opted to use traditional database and mapping for the tags."
    },
    {
      "ProjectName": "Voting dAPP",
      "TeamName": "IRON SWORD",
      "GithubLink": "https://github.com/Rahulbiradar9/VOTING-dAPP",
      "DeployedLink": "",
      "YoutubeLink": "https://www.youtube.com/watch?v=l7s9Tx2Tn94&ab_channel=RahulBiradar",
      "MemberOne": "Rahul Biradar ",
      "MemberTwo": "Nithin Kumar M S ",
      "MemberThree": "Shambulinga M",
      "ProblemSolve": "Blockchain features make it highly secure, preventing unauthorized access and manipulation of votes\nEvery transaction (vote) is recorded on the blockchain and can be publicly verified, enhancing the transparency of the election process\nOnce a vote is recorded on the blockchain, it cannot be altered or deleted, ensuring the integrity of the election results\nlockchain can ensure voter anonymity while still verifying that each vote is legitimate, protecting voter privacy\nWithout a central authority, the system is less susceptible to corruption and centralized points of failure\nIndia uses the \"first past the post\" system for its elections. In this system, voters in each constituency cast their ballots for their preferred candidate, and the candidate who receives the most votes wins the seat. This method is used for both the national elections for the Lok Sabha and the state legislative assembly elections. While the FPTP system is straightforward and easy to understand, it has notable disadvantages. It can lead to disproportional representation, where a party can win a significant majority of seats without a corresponding majority of votes. This system can also marginalize smaller parties and regional voices, encourage tactical voting, and lead to a sense of disenfranchisement among voters who support less popular candidates.",
      "Challenges": "connection errors , metamask wasn't taking any votes , it showing already voted , still working on it !!!!!!!!\n\n"
    },
    {
      "ProjectName": "MedPulseAI",
      "TeamName": "KSQUARE",
      "GithubLink": "https://github.com/NayaKunal30/MedPulseAI",
      "DeployedLink": "https://medpulseai-ml.onrender.com/",
      "YoutubeLink": "https://www.youtube.com/watch?v=N6hml8o6WrU&t=1s&ab_channel=KomalPathak",
      "MemberOne": "Komal Pathak",
      "MemberTwo": "Kunal Nayak",
      "MemberThree": "",
      "ProblemSolve": "MedPulseAI is a cutting-edge health-tech platform leveraging machine learning to help individuals take charge of their well-being. It offers personalized recommendations and predictive insights through:\n\nAlternative Medicine Suggestions: Tailored natural remedies based on user health profiles and history.\n\nAge-Based Lifestyle Therapies: Customized fitness, nutrition, and wellness tips suited to your life stage.\n\nPredictive Health Analytics: Early risk detection for diabetes and heart disease with actionable insights.\n\nEmergency Hospital Locator: Real-time directions to nearby hospitals and clinics in critical situations.",
      "Challenges": "Building MedPulseAI involves several key challenges:\n\nData Privacy & Security: Ensuring compliance with GDPR/HIPAA through encryption, secure authentication, and regular audits.\n\nAccurate ML Models: Requires quality datasets, expert validation, and collaboration with healthcare professionals.\n\nUser Experience: Demands intuitive design backed by thorough research and usability testing.\n\nSystem Integration: Involves standardized APIs and partnerships for connecting with hospital databases and EHRs.\n\nRegulatory Compliance: Staying updated on laws, crafting clear disclaimers, and consulting legal experts.\n\nData Quality: Needs strong data cleaning and regular updates for reliable outputs.\n\nUser Trust & Adoption: Built through transparency, clear communication, and trial offerings.\n\nScalability: Calls for efficient infrastructure and optimized algorithms to handle growth.\n\nTeam Coordination: Success depends on clear roles and collaboration among tech, health, and design experts.\n\n"
    },
    {
      "ProjectName": "Dfiles",
      "TeamName": "Tech3",
      "GithubLink": "https://github.com/Lokesh-Kudipudi/web3ssh-2024",
      "DeployedLink": "",
      "YoutubeLink": "https://www.youtube.com/watch?v=oKBLDVD0sk0&t=1s&ab_channel=Lokesh",
      "MemberOne": "Rohin Sai",
      "MemberTwo": "Lokesh Kudipudi",
      "MemberThree": "Thrivikram Teja",
      "ProblemSolve": "Traditional Web 2.0 technologies often face difficulties to store data over long period of time with minimal cost for the consumer, the subscription plan will be a never ending issue.This problem arises a growing need for a more reliable, secure, and cost-efficient storage solution that can ensure the integrity and availability of data over long periods.",
      "Challenges": "Finding appropriate storage providers for web3 - I got over this problem using LightHouse which uses FileCoin and IPFS technologies, Connecting to MetaMask wallet which was overcome by refering to the documentation, Trying to aviod the old depreciated methods which were used in some tutorials - I got over this problem by refering to the documentation"
    },
    {
      "ProjectName": "Attend Smart",
      "TeamName": "Ceatcodes",
      "GithubLink": "1) https://github.com/abhijit-23blaze/Attend-Smart   2) https://github.com/abhijit-23blaze/BlockRoll-Client",
      "DeployedLink": "",
      "YoutubeLink": "https://www.youtube.com/watch?v=fUhFjMTk9Ic&ab_channel=AadiPatel",
      "MemberOne": "Abhijit Patil",
      "MemberTwo": "Gautam Chouhan",
      "MemberThree": "Patel Aadi",
      "ProblemSolve": "Traditional attendance systems in educational institutions face key issues that reduce efficiency and accuracy. Manual processes are time-consuming, disrupt learning, and lack real-time tracking, delaying administrative decisions. Fraudulent practices, like students marking attendance for peers, lead to inaccurate records and undermine system integrity. Paper-based and some digital systems also pose security risks and are prone to tampering or data loss. Additionally, these systems lack transparency and place a heavy administrative burden on institutions.\n\nThe proposed solution automates attendance, saving time, preventing fraud, ensuring real-time data access, and reducing administrative workload.",
      "Challenges": "Blockchain Costs: Storing data on the blockchain, especially in the form of NFTs, can incur significant costs, particularly with large-scale deployments.\n\nUser Adoption: Getting students and faculty to adopt the new system might be challenging, especially if they are accustomed to traditional methods. Ensuring a user-friendly interface and providing adequate training will be crucial.\n\nData Privacy and Security: While blockchain provides enhanced security, ensuring that all data, especially biometric data, is stored and managed in compliance with privacy regulations (e.g., GDPR) is a significant challenge.\n\nScalability: As the system grows, managing large volumes of data and ensuring the system remains responsive and efficient could become increasingly difficult.\n\nMaintenance and Updates: Regular updates and maintenance will be needed to address security vulnerabilities, fix bugs, and add new features, which could be resource-intensive"
    },
    {
      "ProjectName": "SAVE X ROSS",
      "TeamName": "SUMMER",
      "GithubLink": "https://github.com/SendouD/saveXross",
      "DeployedLink": "https://save-xross.vercel.app/user",
      "YoutubeLink": "",
      "MemberOne": " Jananathan M",
      "MemberTwo": "inthra kumar",
      "MemberThree": " vinay jami",
      "ProblemSolve": "On May 14th, a critical incident unfolded in Chennai where a cow urgently needed rescue. Despite the severity of the situation, the busy crowd around remained indifferent. I reported the issue to the relevant authorities, who assured me that a driver had been dispatched and would arrive shortly.\n\nHowever, it was only on the afternoon of May 15th that I received a call from the driver, inquiring about the location of the distressed animal. This considerable delay in response time underscores a critical problem: the long time taken to rescue animals in danger, serving as an act of negligence from the people’s side.\nTo address these challenges and significantly reduce the response time in animal rescue operations, we propose the development of a Web3-based stake and reward system using ERC20 Tokens.",
      "Challenges": "One of the significant challenges we faced was with the documentation for wagmi, which was somewhat disorganized and led to difficulties in implementation. To overcome this, we switched to using ethers.js, which provided more straightforward and well-documented support for our needs.\n\nAnother challenge we encountered was related to implementing an OTP-based access system. The goal was to allow the issuer to authorize the verifier to confirm whether the driver picked up the animal. This feature was crucial for ensuring that the system rewarded users correctly based on their actions. However, due to time constraints, we were unable to implement this functionality fully. Despite these hurdles, we managed to build a functional system that still meets the core objectives of our project."
    },
    {
      "ProjectName": "fund33",
      "TeamName": "Codegasms",
      "GithubLink": "https://github.com/codegasms/web3ssh",
      "DeployedLink": "",
      "YoutubeLink": "https://www.youtube.com/watch?v=zkC7_8zw4ek",
      "MemberOne": "Vinayak Anand",
      "MemberTwo": " Bishwajeet Sahoo",
      "MemberThree": "Saurabh Pal",
      "ProblemSolve": "The Web3 Crowdfunding Platform allows people to create, manage, and contribute to crowdfunding campaigns in a decentralized, secure, and transparent manner. Users can raise funds for various causes, whether personal projects, startup ventures, or government-related initiatives like disaster relief and public welfare. By leveraging blockchain technology, the platform eliminates the need for intermediaries, reducing costs and increasing trust. Transactions are securely recorded on the blockchain, making them tamper-proof and transparent, which ensures that funds are used as intended. Additionally, the use of MetaMask for wallet management enhances security, allowing users to control their funds directly without relying on third-party services. This system makes fundraising easier, more efficient, and accessible to a global audience, while ensuring the integrity and safety of all financial transactions.",
      "Challenges": "A significant hurdle encountered during the development of the Web3 Crowdfunding Platform was setting up the correct testnet environment for the backend. This issue arose due to the complexities involved in configuring the backend to interact seamlessly with the Ethereum test networks, such as Sepolia or Goerli.\nTo resolve this, a meticulous approach was taken. The backend configuration was audited along with analyzing other users' experience with a particular test environment, to ensure that the proper RPC URLs were used for the desired testnet. This careful setup allowed for a smooth development process, enabling effective testing of smart contracts and transactions without the unpredictability associated with testnet environments.\nStill there were some issues which we fixed by skimming through the docs & countless number of forums."
    },
    {
      "ProjectName": "Decentrald",
      "TeamName": "Blockchain rizz",
      "GithubLink": "https://github.com/TheScorp12/DecentrID",
      "DeployedLink": "",
      "YoutubeLink": "https://www.youtube.com/watch?v=iFp6rrs_uCs",
      "MemberOne": "Subhangi Subhangi",
      "MemberTwo": "Mohammed Choudhry",
      "MemberThree": "",
      "ProblemSolve": "In the realm of Blockhain and Cryptocurriencies, user interactions are usually impersonal and anonymous, represented only by cryptographic wallet addresses. While this anonymity offers privacy, it also creates a barrier to trust and transparency, especially in peer-to-peer transactions and decentralized applications (dApps). Users find it difficult to verify the identity of the parties they are interacting with, leading to potential risks such as fraud, scams, and miscommunication.\nTo address this issue we made a Dapp that integrates identities, such as usernames and profile pictures, with wallet addresses. This solution aims to provide a more personable and transparent interaction experience while maintaining the privacy and security inherent in blockchain technology.",
      "Challenges": "It was a challenge to decide which wallet framework and blockchain interaction to use while building the project. we decided to go with rainbow kit as it offers a wide variety of wallets to connect to, while also being user friendly.\nour Biggest hurdle was time, with the the limited time that we had we were not able to integrate all the functionalities that we wanted to integrate to give the user complete control over their data."
    },
    {
      "ProjectName": "Lockie",
      "TeamName": "Akhil",
      "GithubLink": "No link given on devfolio",
      "DeployedLink": "https://lockie.vercel.app/",
      "YoutubeLink": "https://www.youtube.com/watch?v=SBxM2Xo9xrY",
      "MemberOne": "Akhil Binoy",
      "MemberTwo": "",
      "MemberThree": "",
      "ProblemSolve": "Traditional methods of storing and distributing question papers are prone to risks such as unauthorized access, data breaches, and loss of documents. These vulnerabilities can lead to compromised exam integrity, theft of intellectual property, and logistical challenges in secure distribution.\nHow Lockie Makes Things Easier and Safer\nTamper-Proof Storage: Lockie uses blockchain technology to securely store question papers, ensuring that once uploaded, the content cannot be altered or tampered with.\nDecentralized Access: By leveraging IPFS, Lockie provides a decentralized and distributed network for accessing question papers, making it nearly impossible for a single point of failure to compromise the system.\nTransparent Audit Trails: Every action taken on Lockie, from uploading to accessing documents, is recorded on the blockchain, providing a transparent and immutable audit trail.\nSecure Retrieval: Only authorized users can access the stored question papers, ensuring that sensitive information remains protected.\nSimplified Distribution: Lockie streamlines the distribution process, allowing educators and administrators to securely share question papers with the right stakeholders without the need for intermediaries or cumbersome security measur",
      "Challenges": "One of the major challenges I faced while building Lockie was ensuring secure and efficient storage of question papers on IPFS while maintaining fast retrieval times. Storing large files on a decentralized network like IPFS can lead to slow access times, which is particularly problematic for users who need quick and reliable access to question papers.\n\nTo overcome this, I implemented a multi-layer caching mechanism. By integrating IPFS with a local cache on the client side, I was able to reduce the time it took to retrieve frequently accessed documents. Additionally, I optimized the IPFS storage process by chunking larger files and parallelizing the upload process, which significantly improved both upload and retrieval speeds.\n\nAnother challenge was integrating the blockchain with IPFS in a way that ensured seamless and secure interaction between the two systems. I resolved this by using smart contracts to generate unique cryptographic hashes for each stored document, which are then used as references on the blockchain. This approach not only enhanced the security of the storage but also ensured that the integrity of the data could be easily verified by any user.\n\nThrough these solutions, I was able to build a more efficient, secure, and user-friendly system for storing and retrieving question papers."
    },
    {
      "ProjectName": "medKART",
      "TeamName": "Ether Eagles",
      "GithubLink": "https://github.com/BibhabDasgupta/medKART",
      "DeployedLink": "",
      "YoutubeLink": "",
      "MemberOne": "Snehanshu Pal",
      "MemberTwo": " Shresth Mantry",
      "MemberThree": "BIBHAB DASGUPTA",
      "ProblemSolve": "Medkart is addressing the issue of counterfeit drugs and supply chain transparency in the pharmaceutical industry.\nOur solution focuses on:\nEnsuring drug authenticity: By utilising blockchain technology, QR codes, and cryptographic keys, our application aims to prevent the circulation of counterfeit medications.\nTracking drug conditions: Monitoring temperature and humidity during transit is crucial for maintaining drug efficacy and safety.\nImproving supply chain visibility: By managing drug transfers in batches and leveraging IoT data, they enhance the traceability of products throughout the supply chain.\nOur product aims to build trust and confidence in the pharmaceutical supply chain by providing a robust system for verifying drug authenticity and quality.",
      "Challenges": "1. Blockchain Integration Complexity\nIntegrating blockchain technology, particularly with Solidity and Truffle, posed significant challenges. Ensuring the smart contracts were secure and efficient required rigorous testing and debugging. Additionally, working with Web3 and Metamask to facilitate seamless interactions between the frontend and blockchain added to the complexity.\n\n2. Decentralization Overhead\nWhile decentralization offers numerous benefits, managing the overhead associated with maintaining a decentralized platform was challenging. This included handling network latency, transaction costs, and ensuring that the decentralized nodes communicated effectively.\n\n3. Ensuring Data Privacy and Security\nWith sensitive pharmaceutical data being processed, ensuring robust security measures were in place was critical. Implementing JWT for authentication and securing data transmission required careful attention to prevent vulnerabilities such as token theft or unauthorized access.\n\n4. Cross-Platform Compatibility\nEnsuring that the frontend, built with React, worked seamlessly across different devices and browsers was an ongoing challenge. Additionally, ensuring that blockchain interactions and IoT integrations were consistent across platforms required thorough testing.\n\n5. Maintaining Code Consistency\nWith a complex tech stack involving multiple technologies (React, Node.js, Solidity, IoT.js), maintaining code consistency and adhering to best practices across all components was a challenge. This required careful code reviews, adherence to coding standards, and continuous refactoring.\n\n6. User Experience (UX) Challenges\nDesigning a user-friendly interface that caters to both tech-savvy and non-technical users was challenging. Balancing functionality with simplicity and ensuring that users could interact with the blockchain and IoT features without confusion require"
    },
    {
      "ProjectName": "JewelAssure",
      "TeamName": "FutureFlow",
      "GithubLink": "https://github.com/Catwithatail/JewelAssure",
      "DeployedLink": "",
      "YoutubeLink": "",
      "MemberOne": "Aman Raj",
      "MemberTwo": "Vanya Awasthi",
      "MemberThree": "Anchal Tandekar",
      "ProblemSolve": "The problem JewelAssure solves\nJewelAssure transforms jewelry verification with blockchain technology, addressing the widespread issue of counterfeit products in the online market. The platform securely documents each piece of jewelry on the Ethereum blockchain, recording detailed attributes like carats, weight, color, and design number. This information is stored immutably, ensuring it remains accurate and tamper-proof.\n\nFor buyers, JewelAssure simplifies the verification process by allowing them to confirm authenticity through a unique identifier. This transparent access to verified data eliminates uncertainty, helping consumers trust that their purchases are genuine.\nSellers and manufacturers benefit from JewelAssure by streamlining inventory management. The blockchain system provides a reliable and tamper-proof method for recording jewelry details, replacing traditional documentation methods that can be flawed.\n\nOverall, JewelAssure enhances security and transparency in online jewelry transactions. By leveraging blockchain technology and smart contracts, it ensures accurate and immutable records, protecting both buyers and sellers from fraud. This innovative approach makes online jewelry purchases safer and more trustworthy, offering confidence in every transaction.\n\nChallenges we ran into\nOne major challenge we faced while building JewelAssure was integrating blockchain into our application. Implementing the Ethereum blockchain wasn’t easy—it was actually pretty tough. We ran into issues with managing gas fees, optimizing smart contracts, and making sure everything worked smoothly between the blockchain and our web app. It took a lot of trial and error, testing, and even exploring other solutions like layer-2 scaling to get it right. But in the end, pushing through these difficulties allowed us to create a solid and reliable platform for verifying jewelry authenticity.",
      "Challenges": ""
    },
    {
      "ProjectName": "AUTHENTICITY SENTINEL AI (ASA)",
      "TeamName": "SOLO",
      "GithubLink": "https://github.com/diya07011",
      "DeployedLink": "https://github.com/diya07011/deepfake",
      "YoutubeLink": "",
      "MemberOne": "Diya Guptha",
      "MemberTwo": "",
      "MemberThree": "",
      "ProblemSolve": "The problem AUTHENTICITY SENTINEL AI (ASA) solves\nThe technology is getting more and more advance and the people using it in a wrong way. They create the fake images and fake videos of other person and spread rumours and even try to bully other person.",
      "Challenges": "Challenges I ran into\nWhile working on this project we ran with multiple challenges like debugging the issue , getting proper accuracy. Our projects works on security so it's hard to manage the security of all and after trying multiple times we did it."
    },
    {
      "ProjectName": "CHARITY CHAIN",
      "TeamName": "Sigma Squad",
      "GithubLink": "https://github.com/saiisback/Charity-chain",
      "DeployedLink": "",
      "YoutubeLink": "",
      "MemberOne": "Karthik sharma",
      "MemberTwo": "Akash Sarangi",
      "MemberThree": "Sai Karthik",
      "ProblemSolve": "The problem CHARITY CHAIN solves\nlack of transparency and efficiency in donations are significant challenge\n\n",
      "Challenges": "Challenges we ran into\nmake a frontend for the smart contract we developed, as this web3 is totally new for us.Plus i was the solve member of the team working this project. it was very hectic and new for me. so i could only develop the smart contract. with out any UI to interact with it\n\n"
    },
    {
      "ProjectName": "ThriftyDapp",
      "TeamName": "CryptoConquerors",
      "GithubLink": "https://devfolio.co/projects/thriftydapp-69b0",
      "DeployedLink": "https://github.com/SHARUKA-2005/Hackathon_Web3",
      "YoutubeLink": "https://youtu.be/7jj85vEjhYY",
      "MemberOne": "Reshma",
      "MemberTwo": "Sharuka",
      "MemberThree": "",
      "ProblemSolve": "According to Earth.org , 1.92 Million Tonnes of Clothes end up in the landfills every year! This is a major concern for the environment. Fast Fashion is a global environmental threat that has not been taken so seriously. However, We CryptoConquerors took this seriously and brought up a solution.\"Decentralised Thrift Store - Thrifty\". With this , buyers can buy good quality second hand clothes at a very affordable price and that too with cryptocurrency.\nHere, the buyers and sellers does business in cryptocurrency . Thus, Our Project solves a real-world environmental issue. This when implemented at a international level can substantially reduce the waste generated , poor can afford good quality clothes , Payments in cryptocurrency and towards a better life! Hope you will like our project.",
      "Challenges": "While making this project , we faced so many technical issues. One such was to find the contract address. Though we tried multiple times to get contract address using git command , it showed that compilation was done successfully however it did not show the address. The other issue was connecting the metamask to ganache and deploying our code in ganache. Since we hadnt used ganache before, deploying process took so much time and effort in this project."
    },
    {
      "ProjectName": "EthSplit",
      "TeamName": " Abhiraj Singh",
      "GithubLink": "https://github.com/abhiraj2404/Ethsplit",
      "DeployedLink": "https://amoy.polygonscan.com/tx/0xc8c07a4931dc71175d9373770e9df069291933675e01d219c28633cd0b26b1eb",
      "YoutubeLink": "https://youtu.be/iAMI5sQXIDU",
      "MemberOne": "Abhiraj Singh",
      "MemberTwo": "",
      "MemberThree": "",
      "ProblemSolve": "Managing shared expenses in group activities, households, businesses, and other collaborative scenarios is often cumbersome and prone to disputes. Traditional expense management methods rely on manual tracking, trust, and centralized financial systems, leading to several issues like :\n\nLack of Transparency: In traditional methods, it's difficult to keep track of all expenses and contributions transparently. This lack of visibility can cause misunderstandings and disputes among participants.\nInefficiency: Manually tracking expenses, calculating shares, and settling payments is time-consuming and prone to errors.\nTrust Issues: Trusting one individual to manage the expenses can be problematic, especially in larger groups where not everyone knows each other well.\nCentralized Control: Relying on centralized financial systems or intermediaries (like banks or payment apps) can result in high transaction fees, delays, and dependency on third-party platforms.\nSecurity Risks: Centralized systems are vulnerable to security breaches and fraud, putting users' financial information at risk.\n",
      "Challenges": "Since i am the only member in my team and i was new to solidity and web3 i faced a lot of beginner problems. The most difficult was getting the smart contract to work according to my needs. Still i tried my best and i am proud of the project i have been able to build in mere 2 days. If i had more time it would have been much better and more refined. Still i believe that my project idea is pretty good and scalable and it can be used for a number of purposes.\n\n"
    },
    {
      "ProjectName": "TendersRaid",
      "TeamName": "spell_break",
      "GithubLink": "https://github.com/rejzzzz/TendersDapp",
      "DeployedLink": "",
      "YoutubeLink": "https://youtu.be/EbwMWefBle8",
      "MemberOne": "Arnav Rajan",
      "MemberTwo": "sai tej",
      "MemberThree": "Rejwan ulhaque",
      "ProblemSolve": "This platform aims to solve the key challenges in traditional tender systems, such as cost overruns, credit risks, contract enforcement, and process delays.",
      "Challenges": "We faced challenges in implementing role-based navigation, smart contract integration. We resolved these by carefully managing user states, synchronizing blockchain interactions with the UI"
    },
    {
      "ProjectName": "Music_NFT",
      "TeamName": "Kodex",
      "GithubLink": "https://github.com/The-TACS/Music_NFT",
      "DeployedLink": "",
      "YoutubeLink": "",
      "MemberOne": "Ayush Tiwari",
      "MemberTwo": "Divya Verma",
      "MemberThree": "eb2e6a24ff3c452",
      "ProblemSolve": "People can use the Music NFT platform to:\n\nMusic revenue: Artists can sell their music directly as NFT bypassing traditional intermediaries and saving a lot of money.\nEarn royalties: Musicians earn a fee each time they resell their NFT, providing them with an ongoing income from their work.\nProve Ownership: Collectors and fans can own unique digital assets, with blockchain ensuring authenticity and proof of ownership.\nTrade securely: All transactions are protected by smart contracts, which provide transparency and eliminate the risk of fraud.\nArtist Support: Fans can support their favorite artists directly by buying and trading their music NFT.",
      "Challenges": "One of the main challenges we faced was implementing a royalty distribution strategy. It required Solidity to meticulously manage payables and accurately count gas. Initially, the deal ran into issues where royalties were not allocated properly due to a misunderstanding of the transfer function.\n\nTo overcome this, we modified the smart contract to prepare royalty accounting and distribution before NFT was transferred to the new owner. We have also conducted rigorous testing of the agreement on test networks to ensure that it works as expected, allowing artists to continue to receive their share of revenue without any hand interference.\n\n"
    },
    {
      "ProjectName": "EngageCoin : Youtuber's own coin",
      "TeamName": " Pioneers",
      "GithubLink": "https://github.com/0xnimje/engagecoin",
      "DeployedLink": "",
      "YoutubeLink": "",
      "MemberOne": "Om Bhaviskar",
      "MemberTwo": "Rushab Taneja",
      "MemberThree": "Sarthak nimje",
      "ProblemSolve": "We noticed that in the crypto world, token prices usually only fluctuate based on supply and demand. This can be pretty limiting, especially when you consider how much value is generated from user engagement on platforms like YouTube. Think about it—popular YouTube channels with tons of views, likes, and comments have a lot of influence, but that doesn’t really show up in their token’s value. EngageCoin is our solution to this. We’re creating a token system where the price isn’t just about market dynamics but also reflects how engaging a YouTube channel is. This way, tokens associated with highly engaging content are more accurately valued.",
      "Challenges": "One of the biggest hurdles we faced was figuring out how to reliably pull in YouTube engagement metrics and feed them into our smart contract. We wanted to ensure this process was both secure and decentralized, which is no small task. We had to develop a custom oracle to fetch the data and then use Filecoin for decentralized storage. This way, the data is safe, and our system scales well as we grow. Another tricky part was getting the token price to adjust based on both traditional market factors and real-time engagement data. It required us to build custom smart contract functions to make it all work seamlessly."
    }
  ]